10/data/attachments/aa32e807ac32ff0b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_bd8adb16-4a75-4703-bb95-923bcd3b443a</nif:username>
            <nif:friendToBeAdded>Brian_team_Friend_71316_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>